Repository: lawrancej/logisim
Catalog: xlate/ru/doc/omegat-logisim-doc_ru-omegat.tmx
Source language: en
Languages: ru_ru

source: /** The list of all tools contained in this library.
ru_ru: /** Список всех инструментов, содержащихся в этой библиотеке.

source: Clock input: At the instant that this input value switches from 0 to 1 (the rising edge), the value will be updated according to the other inputs on the west edge.
ru_ru: Тактовый вход: в момент, когда значение на этом входе меняется с 0 на 1 (передний фронт), значение триггера будет обновлено в соответствии с другими входами на западном крае.

source: The color with which to draw the text appearing in the terminal.
ru_ru: Цвет, которым отрисовывается текст внутри терминала.

source: Each input has as many bits as there are columns in the matrix, with the low-order bit corresponding to the rightmost pixel in the row.
ru_ru: Каждый вход имеет столько битов, сколько столбцов в матрице; младший бит соответствует правому пикселю строки.

source: In this example, which implements an edge-triggered 4-bit Gray code counter, we define a CounterData class to represent the counter's state, in addition to the InstanceFactory subclass as illustrated previously.
ru_ru: В этом примере, который реализует реагирующий на фронт 4-битный счётчик кода Грея, мы объявляем класс CounterData для представления состояния счётчика, в дополнение к подклассу InstanceFactory, как было показано раньше.

source: The location of the input pin relative to the component.
ru_ru: Расположение входного контакта относительно компонента.

source: * is created, and that object will handle all user events.
ru_ru: * создан, и этот объект будет обрабатывать все события пользователя.

source: n-gate
ru_ru: n-затвор

source: Buffer Length
ru_ru: Длина буфера

source: // current value in the instance.)
ru_ru: // текущее значение в экземпляре.)

source: Over a full semester in upper-division computer architecture courses
ru_ru: На протяжении всего семестра в курсах архитектуры компьютеров высокого уровня

source: * the component's anchor location, then whether the port is an
ru_ru: * места крепления компонента, затем является ли порт

source: allowed only for noncommercial distribution and only if you
ru_ru: допустима только для некоммерческого распространения, и только если вы

source: Logisim will draw a red rectangle around the top address.
ru_ru: Logisim нарисует красный прямоугольник вокруг верхнего адреса.

source: The Plexers library includes control components.
ru_ru: Библиотека Плексоры содержит управляющие компоненты.

source: Once you have downloaded a library, you can import it into your project by right-clicking the project in the explorer pane (the top line) and choosing Load Library > JAR Library....
ru_ru: После того, как вы загрузили библиотеку, вы можете импортировать её в ваш проект, щёлкнув правой кнопкой мыши на проекте в панели проводника (верхняя строка), и выбрав Загрузить библиотеку > Библиотека JAR... .

source: Number of Stages
ru_ru: Количество ступеней

source: Note that the RAM component requires you to choose which memory address(es) should be logged; it allows logging only for the first 256 addresses.
ru_ru: Обратите внимание, что компонент ОЗУ требует выбрать, какие адреса памяти должны записываться в журнал; он поддерживает запись только первых 256 адресов.

source: The bit width of the component's input and output.
ru_ru: Разрядность входа и выхода компонента.

source: Clears everything about the current circuit's state, so that it is as if you have just opened the file again.
ru_ru: Очищает всё связанное с текущим состоянием схемы, так, как если бы вы просто открыли файл заново.

source: This section is intended to make thoroughly clear what is believed to be a consequence of the rest of this License.
ru_ru: Этот раздел предназначен для того, чтобы тщательно прояснить, что полагается следствием из остальной части данной Лицензии.

source: The following table illustrates the distinction.
ru_ru: В следующей таблице приведены различия.

source: Configuring Export
ru_ru: Настройка экспорта

source: The value rising edge indicates that the component should update its value at the instant when the clock rises from 0 to 1.
ru_ru: Значение Передний фронт означает, что компонент должен обновляться в момент, когда значение на тактовом входе меняется с 0 на 1.

source: The component input that will be used to compute the output if the control input is 1.
ru_ru: Вход компонента, который будет использован для вычисления значения на выходе, если на управляющем входе 1.

source: This value will always be between 0 and divisor-1.
ru_ru: Это значение всегда будет между 0 и делитель-1.

source: Removes the currently displayed circuit from the project.
ru_ru: Удаляет отображаемую в данный момент схему из проекта.

source: Each component in a circuit has a single point identifying its location; a user sees this when creating a new component: The mouse click identifies just a single location, and the component is placed relative to that (usually with the primary output at the mouse's location) The anchor identifies the mouse's location relative to the overall drawing when the subcircuit is created.
ru_ru: Каждый компонент в схеме имеет одну точку, определяющую его положение; пользователь видит это при создании нового компонента: щелчок мыши задаёт только одну точку, и компонент размещается относительно неё (обычно с главным выходом в этой точке). Якорь задаёт эту точку относительно всего рисунка при создании подсхемы.

source: High Duration
ru_ru: Продолжительность единицы

source: java -jar jarFileName [options] [filenames]
ru_ru: java -jar имяJarФайла [параметры] [именаФайлов]

source: West edge, north pin (output, bit width matches Bit Width attribute)
ru_ru: Западный край, северный контакт (выход, разрядность соответствует атрибуту Разрядность)

source: For our example, we'll suppose we've built the below circuit in a file named adder-test.circ.
ru_ru: Для примера мы предположим, что сохранили схему, показанную ниже, в файл с именем adder-test.circ.

source: Tutorial: Orienting yourself
ru_ru: Пособие: Осваиваемся

source: Label Font
ru_ru: Шрифт метки

source: // invoke propagate on the counter at its next opportunity.
ru_ru: // чтобы вызвать просчёт для счётчика при первой же возможности.

source: For example, if a circuit contains a flip-flop, and that circuit is used as a subcircuit several times, then each subcircuit's flip-flop will have its own value when simulating the larger circuit.
ru_ru: Например, если схема содержит триггер, и эта схема используется как подсхема несколько раз, то триггер каждой подсхемы будет иметь собственное значение при моделировании большей схемы.

source: Here is how I would do it under Linux's bash:
ru_ru: Вот как бы я сделал это под Linux в bash:

source: If you click at a point where there is not currently a label to be edited, Logisim will initiate the addition of a new Label component.
ru_ru: Если вы щёлкните в точке, где в данный момент нет метки для редактирования, то Logisim инициирует добавление нового компонента Метка.

source: You would press that key with the D key.)
ru_ru: Вам нужно нажать эту клавишу с клавишей D.)

source: Logisim libraries
ru_ru: Библиотеки Logisim

source: * than components; practically speaking, though, you'll most often want
ru_ru: * чем компоненты; с практической точки зрения, однако, вы чаще захотите

source: Exactly which index it computes depends on the Type attribute, as illustrated by the examples in the below table for the 8-bit sample input 11010100.
ru_ru: Какой в точности номер вычисляется, зависит от атрибута Тип, как показано на примерах в таблице ниже для 8-битного входного значения 11010100.

source: * this case, there is just one attribute - the width - whose default
ru_ru: * этом случае атрибут только один - разрядность - и он по умолчанию

source: java -jar jarFileName -plain -gates shaped -locale en
ru_ru: java -jar имяJarФайла -plain -gates shaped -locale en

source: This component subtracts values coming in via the west inputs (the upper minus the lower) and outputs the difference on the east output.
ru_ru: Этот компонент вычитает значения, поступающие на западные входы (верхнее минус нижнее) и выдаёт разность на восточный выход.

source: int ct = (x >> 16) ^ x; // compute parity of x
ru_ru: int ct = (x >> 16) ^ x; // вычислить соотношение для x

source: Normally, though, a pixel at a particular row-column location is lit if the corresponding column bit in the upper input is 1 and the corresponding row bit in the lower input is 1.
ru_ru: В нормальной ситуации пиксель на пересечении определённых строки и столбца горит, если значение бита соответствующего столбца на верхнем входе равно 1, и значение бита соответствующей строки на нижнем входе равно 1.

source: Inside, each value is listed using hexadecimal.
ru_ru: Значения внутри представлены в шестнадцатеричном виде.

source: As you can see, the Odd Parity gate and the XOR gate behave identically with two inputs; similarly, the even parity gate and the XNOR gate behave identically.
ru_ru: Как вы можете видеть, элементы Нечётность и Исключающее ИЛИ ведут себя одинаково в случае двух входов; аналогично, элементы Чётность и Исключающее ИЛИ-НЕ ведут себя одинаково.

source: /** Says how an individual instance should appear on the canvas.
ru_ru: /** Говорит, как должен отдельный экземпляр появляться на холсте.

source: The component optionally also supports parallel loads and stores to all stages' values.
ru_ru: Компонент также опционально поддерживает параллельное чтение и запись значений всех ступеней.

source: The below screen shot illustrates a simple circuit for finding the bitwise AND of two three-bit inputs.
ru_ru: Снимок экрана ниже показывает простую схему для вычисления побитового И между двумя трёхбитными входами.

source: If a wire connects two components demanding different bit widths, Logisim will complain of "Incompatible widths" and indicate the offending locations in orange.
ru_ru: Если провод соединяет два компонента, требующие разную разрядность, Logisim пожалуется на "Несовместимые разрядности" и обозначит вызывающие проблему участки оранжевым цветом.

source: Be sure to leave plenty of room for stuff on the left.
ru_ru: Не забудьте оставить достаточно места для вещей слева.

source: This was itself based on C code written by Sverre H. Huseby.
ru_ru: Он в свою очередь был основан на C коде, написанном Сверре Хьюсби.

source: TTY
ru_ru: Терминал

source: Each time you redistribute the Program (or any work based on the Program), the recipient automatically receives a license from the original licensor to copy, distribute or modify the Program subject to these terms and conditions.
ru_ru: Каждый раз, когда вы повторно распространяете Программу (или любое произведение, основанное на Программе), получатель автоматически получает лицензию от первоначального держателя лицензии на копирование, распространение или модификацию Программы, обсуждаемую в этих определениях и условиях.

source: If you attempt to poke a subcircuit's input, a dialog will pop up asking, The pin is tied to the supercircuit state.
ru_ru: При попытке изменения значения на входе подсхемы появится диалоговое окно с вопросом Значение на контакте привязано к состоянию надсхемы.

source: Tutorial
ru_ru: Пособие начинающего

source: Provides the color dialog box that pops up when configuring colors (as with the LED component).
ru_ru: Предоставляет диалоговое окно выбора цвета, которое всплывает при настройке цветов (как у компонента Светодиод).

source: This input is interpreted as an unsigned four-bit number, and the corresponding hexadecimal digit is displayed.
ru_ru: Этот вход интерпретируется как беззнаковое четырёхбитное число, и соответствующая шестнадцатеричная цифра отображается на индикаторе.

source: The propagation algorithm, which normally works silently without any problems, will become very visible when you create a circuit that oscillates.
ru_ru: Алгоритм просчёта значений, который обычно работает тихо, без проблем, станет очень заметным, когда вы создадите схему, которая возбуждается.

source: Subcircuits (that is, instances of using one circuit as a "black box" within another) are one example of this: In addition to the above two items, the pop-up menu includes another item.
ru_ru: Подсхемы (то есть случаи использования одной схемы как "чёрного ящика" внутри другой) - один из таких примеров: в дополнение к двум вышеуказанным элементам всплывающее меню включает ещё один пункт.

source: But you'd also have to rewire the circuit so that the wires hit the AND gate's left side.)
ru_ru: Но вы также должны перемонтировать схему так, чтобы провода подходили к левой стороне элемента И.)

source: Step 4: Testing your circuit
ru_ru: Шаг 4: Проверка вашей схемы

source: All of the circuits defined in the first project will then be available as subcircuits for the second.
ru_ru: Все схемы, объявленные в первом проекте, будут затем доступны как подсхемы для другого.

source: Limitations
ru_ru: Ограничения

source: Move Circuit Up
ru_ru: Переместить схему вверх

source: When the component is selected or being added, the digits '0' through '9' alter its Number of Inputs attribute, Alt-0 through Alt-9 alter its Data Bits attribute, and the arrow keys alter its Facing attribute.
ru_ru: Когда компонент выбран, или уже добавлен, клавиши от 0 до 9 меняют его атрибут Количество входов, комбинации от Alt-0 до Alt-9 меняют его атрибут Биты данных, а клавиши со стрелками меняют его атрибут Направление.

source: Clear: When this is 1, all values in memory are pinned to 0, no matter what the other inputs are.
ru_ru: Очистка: когда на этом входе 1, все значения в памяти будут фиксированы на 0, вне зависимости от значений на других входах.

source: The direction of the component (its output relative to its inputs).
ru_ru: Направление компонента (его выхода относительно его входов).

source: Allows distribution of Logisim as a Windows executable.
ru_ru: Позволяет распространение Logisim в виде исполняемого файла Windows.

source: This is intended to simulate the unevenness of real circuits.
ru_ru: Это сделано для того, чтобы имитировать неравномерность реальных схем.

source: If you are viewing a subcircuit's state, the entire hierarchy is cleared.
ru_ru: Если вы рассматриваете состояние подсхемы, то вся иерархия будет очищена.

source: We'll start by seeing how to execute a circuit from the command line.
ru_ru: Начнем с того, как выполнить схему из командной строки.

source: If you were to double-click the 2:1 MUX circuit in the explorer pane, then the window would switch to editing the 2:1 MUX circuit instead.
ru_ru: Если вы щёлкнули два раза на схеме 2:1 MUX в панели проводника, то вместо этого окно переключится на редактирование схемы 2:1 MUX.

source: The text within the label associated with the register.
ru_ru: Текст внутри метки, привязанной к регистру.

source: Logisim includes an integrated hex editor for viewing and editing the contents of memory.
ru_ru: Logisim включает в себя встроенный шестнадцатеричный редактор для просмотра и редактирования содержимого памяти.

source: This option is meant to more closely approximate the interface of many available random-access memories.
ru_ru: Этот вариант более приближен к интерфейсу многих доступных типов памяти с произвольным доступом.

source: South edge, labeled c out (output, bit width matches Data Bits attribute)
ru_ru: Южный край, отмечен c out (выход, разрядность соответствует атрибуту Биты данных)

source: Show component tips: Specifies whether to display the "tool tips" that will temporarily appear when the mouse hovers over components supporting them.
ru_ru: Показывать подсказки для компонентов: указывает, следует ли отображать "подсказки", которые будут появляться на время при наведении указателя мыши на компоненты, поддерживающие их.

source: There is no way to insert a line break into a label.
ru_ru: Нет способа вставить знак перехода на следующую строку в метку.

source: The next value is loaded from the D input.
ru_ru: Следующее значение загружается со входа D.

source: Next: Poking memory.
ru_ru: Далее: Нажатие на память.

source: Emits 1 on exactly one output; which output is 1 depends on the current value received through the input on the south edge.
ru_ru: Выдаёт 1 строго на одном из выходов; на каком из выходов будет 1, зависит от значения, принятого в данный момент на входе на южном крае.

source: A single drag of the mouse can create multiple wire segments.
ru_ru: Однократное перетаскивание мыши может создать несколько сегментов провода.

source: The two pins on the west side of the box correspond to the two pins that face east in the 2:1 MUX circuit; the pin on the box's east side corresponds to the 2:1 MUX's west-facing pin (which happens to be an output pin); and the pin on the box's south side corresponds to the 2:1 MUX's north-facing pin.
ru_ru: Два контакта на западном крае коробки соответствуют двум контактам, направленным на восток в схеме 2:1 MUX; контакт на восточной стороне коробки соответствует контакту схемы 2:1 MUX, направленному на запад (который является выходным контактом); а контакт на южной стороне коробки соответствует контакту схемы 2:1 MUX, направленному на север.

source: The outputs are numbered starting with 0 on the north.
ru_ru: Выходы, пронумерованные с 0 начиная с севера.

source: If any of the input bits are floating or error values, then the output will contain error bits in the output corresponding to the range of possible outputs depending on whether those floating/error values are counted as zeroes or ones.
ru_ru: Если любой из входных битов плавающий или имеет значение ошибки, то выходное значение будет содержать биты с ошибкой, соответствующие диапазону возможных выходных значений, зависящих от того, как считать плавающие значения / значения ошибки: как нули или как единицы.

source: Demultiplexer
ru_ru: Демультиплексор

source: Each input has as many bits as there are rows in the matrix, with the low-order bit corresponding to the southmost pixel in the column.
ru_ru: Каждый вход имеет столько битов, сколько строк в матрице; младший бит соответствует южному пикселю столбца.

source: Several other components will display these tips, too: For some of the pins of a built-in flip-flop, for example, hovering over it explains what that pin does.
ru_ru: Некоторые другие компоненты тоже будут показывать эти подсказки: для некоторых контактов встроенных триггеров, например, проведение мышью над ними объясняет, что делает этот контакт.

source: The component is designed so that it can be cascaded with other multipliers to multiply a multiplicand with more bits than is possible with a single multiplier: The carry-in input provides a multi-bit value to be added into the product (if it is specified), and a carry-out output provides the upper half of the product result, which can be fed into another multiplier.
ru_ru: Компонент разработан таким образом, что его можно включать каскадно с другими множителями чтобы обеспечить умножение с большим количеством битов, чем возможно с одним множителем: вход переноса предоставляет многобитное значение, которое должно быть добавлено к произведению (если оно задано), а выход переноса предоставляет старшую половину произведения, которая может быть подана на другой множитель.

source: This
ru_ru: Этот

source: Write Enable - when 1 (or floating or error), a clock edge will result in processing a new character from the data input.
ru_ru: Разрешение записи - когда значение равно 1 (или плавающее, или ошибка), срабатывание тактового входа будет приводить к обработке нового символа с входа Данные.

source: Pins
ru_ru: Контакты

source: Emits the value specified in its Value attribute.
ru_ru: Выдаёт значение, указанное в его атрибуте Значение.

source: The bit width of the component's primary output.
ru_ru: Разрядность основного выхода компонента.

source: Specifies what each bit of the outputs should be when the component is disabled (i.e., when the enable pin is 0).
ru_ru: Определяет, каким должен быть каждый бит выходов, когда компонент выключен (то есть когда на контакте Разрешить - 0).

source: You can change the value for all selected components' attribute at once by using the attribute table.
ru_ru: Вы можете изменить значение атрибута всех выбранных компонентов одновременно, используя таблицу атрибутов.

source: (Again, I'm leaving a bit of space between the OR gate and the output pin, but you might choose to place them right next to each other.)
ru_ru: (Опять же, я оставляю немного пространства между элементом ИЛИ и выходным контактом, но вы можете разместить их сразу друг за другом.)

source: Via the Project menu
ru_ru: Через меню Проект

source: The precise process is a little confusing in its description; but it works quite intuitively in practice: If you request a particular wire segment using the Wiring Tool, that segment will be split apart wherever it hits a pin for an existing component, or wherever it hits the endpoint of an existing wire segment.
ru_ru: Точное описание процесса немного запутывает, но это работает достаточно интуитивно на практике: если вы запрашиваете определённый сегмент провода используя Инструмент Проводка, то этот сегмент будет разделён во всех точках, где он касается контакта существующего компонента, или точках, где он касается концов существующего сегмента провода.

source: Creates a copy of all components in the current selection.
ru_ru: Создает копию всех компонентов в текущем выделении.

source: Logisim helpfully circles in red each location that seems to be involved in the oscillation.
ru_ru: Logisim услужливо обводит красным каждое место, которое похоже участвует в возбуждении.

source: This is intended both to help with scripted verification of circuit designs and to help instructors perform automated testing of students' solutions.
ru_ru: Это сделано для проверки схем с помощью скриптов и чтобы помочь преподавателям выполнять автоматическую проверку работ учащихся.

source: Even beyond this, I am not a circuit design specialist; thus, there may well be errors in the propagation technique of which I am not aware.
ru_ru: Даже не говоря об этом, я не специалист по разработке схем, так что вполне могут быть ошибки в методе просчёта значений, о которых я не знаю.

source: The following examples are all valid representations of the same expression.
ru_ru: Все нижеприведённые примеры - допустимые представления одного и того же выражения.

source: (I must admit, though, that I have not subjected this statement to a rigorous test.) You can configure the XOR and XNOR gates to use parity by changing its Multiple-Input Behavior attribute.
ru_ru: (Должен признать, однако, что я не подвергал это заявление серьезным испытаниям.) Вы можете настроить элементы Исключающее ИЛИ и Исключающее ИЛИ-НЕ на использование одного из вариантов, меняя его атрибут Многовходовое поведение.

source: This allows wired-or and wired-and connections, as illustrated in the AND/OR/NAND/NOR Gate documentation.
ru_ru: Это позволяет создавать соединения "монтажное ИЛИ" и "монтажное И", как показано в статье документации Элементы И/ИЛИ/И-НЕ/ИЛИ-НЕ.

source: As long as it is 1, the register's value is pinned to 0.
ru_ru: Пока на нём 1, значение регистра фиксируется на 0.

source: The values will cycle through 0, 1, and x (representing a "don't care").
ru_ru: Значения будут переключаться между 0, 1, и x (обозначающим "не важно").

source: The Use Two-Input Gates Only option specifies that you want all gates constructed to have two inputs.
ru_ru: Опция Использовать только двухвходовые элементы определяет, что вы хотите, чтобы все построенные элементы имели по два входа.

source: Active On High?
ru_ru: Активен при единице?
